app/controllers/chemicals_controller.rb

SELECT * FROM `chemicals` ORDER BY name ASC LIMIT 0, 30
SELECT count(*) AS count_all FROM `chemicals`
---
  def index
    #@chemicals = Chemical.all
    #from will_paginate example
    #@posts = Post.paginate_by_board_id @board.id, :page => params[:page], :order => 'updated_at DESC'

    @chemicals = Chemical.paginate :page => params[:page], :order => 'name ASC'

SELECT * FROM `chemicals` WHERE (`chemicals`.`id` = 148)
---
  def show
    @chemical = Chemical.find(params[:id])

INSERT INTO `chemicals` (`name`, `smiles`, `location`, `created_at`, `msds_content_type`, `msds_updated_at`, `quantity`, `notes`, `supplier`, `updated_at`, `amount`, `catalognumber`, `msds_file_name`, `msds_file_size`, `formula`, `storage`, `inchi`, `cas`) VALUES('Water', '', '', '2009-01-10 18:40:45', 'text/plain', '2009-01-10 18:40:45', 1, '', '', '2009-01-10 18:40:45', '1L', '', 'water_msds.txt', 30, 'H2O', '', '', '')
---
  def create
    @chemical = Chemical.new(params[:chemical])
    if @chemical.save